"""Создайте кортеж из одного элемента, чтобы при итерировании по этому элементу последовательно
выводились значения 1, 2, 3. Убедитесь что len() исходного кортежа возвращает 1."""


tuple1 = ([1, 2, 3], )

print(tuple1[0], len(tuple1))
